
[{
	"name": "Generic smart USSD client module embarked in a telecommunication terminal",
	"summary": "",
	"abstract": "A digital telecommunications system communicates with an unstructured supplementary service data protocol by a digital application located on a mobile terminal. The digital application includes a navigation module, a presentation module, an interpreter module and an encryption module. The digital application interprets data received from an unstructured supplementary service data protocol that communicates with a telecommunications network and displays interpreted data on a screen of said mobile terminal from data received from the unstructured supplementary service data protocol. The digital application interprets a request of a user entered into the mobile terminal in response to the interpreted data displayed on the screen of the mobile terminal, and sends from the mobile terminal data interpreted from the request of the user to the telecommunications network by the unstructured supplementary service data protocol.",
	"url": null,
	"owner": "",
	"publication_number": "08938494",
	"publication_date": "2015-01-20",
	"application_number": "13377962",
	"application_date": "2010-06-15",
	"tags": null,
	"slug": "generic-smart-ussd-client-module-embarked-in-a-telecommunication-terminal",
	"match_type": "description"
},
{
	"name": "Medical device tracking system and apparatus",
	"summary": "",
	"abstract": "A method for tracking medical devices and tools in a medical environment is disclosed. The method includes registering a plurality of radio frequency identification (RFID) tags with a plurality of medical tools, generating an item list comprising a set of medical tools, wirelessly sensing the RFID tags associated with an assembled set of medical tools, assembled in preparation of a medical procedure based upon the generated item list, deciding, if the RFID tags associated with the assembled medical tools is sensed, that the medical device or tool is present in the assembled set of the medical tools, generating a checked-in list of medical tools based upon the deciding, accounting medical tools assembled for check-out by wirelessly sensing the RFID tags associated with the medical tools assembled for check-out, and displaying a list of medical tools associated with the checked-in list and not included in the accounting.",
	"url": null,
	"owner": "",
	"publication_number": "08925812",
	"publication_date": "2015-01-06",
	"application_number": "13834370",
	"application_date": "2013-03-15",
	"tags": null,
	"slug": "medical-device-tracking-system-and-apparatus",
	"match_type": "description"
},
{
	"name": "Platform for arranging services between goods manufacturers and content or service providers and users of virtual local community via authorized agents",
	"summary": "",
	"abstract": "A social networking platform having users grouped into multiple groups of residents based on users' geographical areas, each group representing a virtual local community representing the corresponding geographical area. Each resident is identified by a resident identifier having a common local community identifier that uniquely identifies the corresponding geographical area in which the residents actually reside. Each resident is provided a three-dimensional (3D) homepage having items resembling items owned by the resident in an actual resident home. Some of the items decorated in the 3D homepage can be activate to invoke an authorized agent which will access a goods/service provider on behalf of the resident for purchasing further items. An authorized agent can be installed and available to a virtual community only if the residents allow. Based on the purchase, a resident is rewarded with credits for future purchases and ownership shares of the authorized agent.",
	"url": null,
	"owner": "",
	"publication_number": "08938682",
	"publication_date": "2015-01-20",
	"application_number": "13655792",
	"application_date": "2012-10-19",
	"tags": null,
	"slug": "platform-for-arranging-services-between-goods-manufacturers-and-content-or-service-providers-and-users-of-virtual-local-community-via-authorized-agents",
	"match_type": "description"
},
{
	"name": "Security protection apparatus and method for endpoint computing systems",
	"summary": "",
	"abstract": "A unified security management system and related apparatus and methods for protecting endpoint computing systems and managing, providing, and obtaining security functions is described. Various forms of the system, apparatus and methods may be used for improved security, security provisioning, security management, and security infrastructure.",
	"url": null,
	"owner": "",
	"publication_number": "08938799",
	"publication_date": "2015-01-20",
	"application_number": "11597486",
	"application_date": "2005-06-15",
	"tags": null,
	"slug": "security-protection-apparatus-and-method-for-endpoint-computing-systems",
	"match_type": "description"
},
{
	"name": "Method of rendering and manipulating anatomical images on mobile computing device",
	"summary": "",
	"abstract": "Methods are provided for rendering an image of an anatomical object on a display of a mobile computing device. Sensors of the mobile computing device are interrogated to determine an orientation, or a change in orientation, of the computing device. Transformations are determined for rotating and positioning the image of the anatomical object such that the image appears to be stationary after a change in the orientation of the mobile computing device. Additional image data associated with a surgical tool or a surgical plan may also be rendered on the device for planning and/or training simulations.",
	"url": null,
	"owner": "7D Surgical Inc.",
	"publication_number": "08933935",
	"publication_date": "2015-01-13",
	"application_number": "13675196",
	"application_date": "2012-11-13",
	"tags": null,
	"slug": "method-of-rendering-and-manipulating-anatomical-images-on-mobile-computing-device",
	"match_type": "description"
},
{
	"name": "Knowledge management tool",
	"summary": "",
	"abstract": "A system, method and article of manufacture are provided for managing data across an enterprise. A request for information is received from a user. Data relating to the user request is searched for in at least two geographically separated information repositories. The results of the search are presented to the user. The user is allowed to browse through additional data of the information repositories. Links between data items and other data entries in the information repositories are created according to relationships the data items have to the other data entries.",
	"url": null,
	"owner": "Accenture Global Services Limited",
	"publication_number": "08938435",
	"publication_date": "2015-01-20",
	"application_number": "12005946",
	"application_date": "2007-12-27",
	"tags": null,
	"slug": "knowledge-management-tool",
	"match_type": "description"
},
{
	"name": "Managing media player sound output",
	"summary": "",
	"abstract": "A method includes initiating media player instances for producing output by execution on an electronic device. Each of the media player instances is implemented using a modular framework on the electronic device configured to have each of multiple types of media player runtimes implemented therein and to host modules that configure any of the types of media player runtimes for respective device types. The method includes determining, using a sound module of the modular framework, which of the media player instances should be used for audio output by the electronic device. The method includes generating the audio output using the electronic device, the audio output produced by at least one of the media player instances as determined.",
	"url": null,
	"owner": "Adobe Systems Incorporated",
	"publication_number": "08938674",
	"publication_date": "2015-01-20",
	"application_number": "12484691",
	"application_date": "2009-06-15",
	"tags": null,
	"slug": "managing-media-player-sound-output",
	"match_type": "description"
},
{
	"name": "Systems and methods for managing instantiation of interface objects",
	"summary": "",
	"abstract": "A system and method are described for managing instantiation of interface elements in a rich Internet application (RIA) that includes systematically creating a tree of descriptive nodes that describe the visual interface elements of the application. Only interface elements that are not stacked under other objects or not fully hidden on the screen are instantiated using the corresponding descriptive nodes. Detail objects corresponding to the descriptive nodes are then constructed and used by a rendering engine to render the visual interface elements of the declarative application. As the user moves to locations within the application that are stacked under other objects or are hidden, the descriptive nodes and detailed objects are created representing the interface elements of those locations for rendering by the rendering engine.",
	"url": null,
	"owner": "Adobe Systems Incorporated",
	"publication_number": "08938693",
	"publication_date": "2015-01-20",
	"application_number": "13036077",
	"application_date": "2011-02-28",
	"tags": null,
	"slug": "systems-and-methods-for-managing-instantiation-of-interface-objects",
	"match_type": "description"
},
{
	"name": "Partitioning resources of a processor",
	"summary": "",
	"abstract": "Embodiments describe herein provide an apparatus, a computer readable medium and a method for simultaneously processing tasks within an APD. The method includes processing a first task within an APD. The method also includes reducing utilization of the APD by the first task to facilitate simultaneous processing of the second task, such that the utilization remains below a threshold.",
	"url": null,
	"owner": "Advanced Micro Devices, Inc.",
	"publication_number": "08933942",
	"publication_date": "2015-01-13",
	"application_number": "13315121",
	"application_date": "2011-12-08",
	"tags": null,
	"slug": "partitioning-resources-of-a-processor",
	"match_type": "description"
},
{
	"name": "Smart small form-factor pluggable transceiver for data networks",
	"summary": "",
	"abstract": "In one embodiment, a smart small form-factor pluggable (SSFP) transceiveru2014compatible with SFP size, power, and interconnection standardsu2014includes an optical transceiver, an electrical connector, a protocol processing engine, and a CPU. The SSFP transceiver is configured for use at a client site having no network interface device (NID). The SSFP transceiver (1) mates to a client's network device at an electrical interface within the network device and (2) connects to a network provider's central office (CO) node via an optical cable at an optical interface. The SSFP transceiver is configured to (1) be powered by the network device, (2) power-up upon mating with the network device, (3) be configured by a remote management agent (RMA) of the network provider for communication with the provider network, (4) respond to/generate Operation, Administration, and Management (OAM) messages from/for the CO node, and (5) provide OAM demarcation functions of a conventional NID.",
	"url": null,
	"owner": "Alcatel Lucent",
	"publication_number": "08938166",
	"publication_date": "2015-01-20",
	"application_number": "13719992",
	"application_date": "2012-12-19",
	"tags": null,
	"slug": "smart-small-formfactor-pluggable-transceiver-for-data-networks",
	"match_type": "description"
},
{
	"name": "Detecting undesirable computing activity",
	"summary": "",
	"abstract": "Instances executing within a programmable execution service (u201cPESu201d) that are engaged in undesirable computing activity can be identified by comparing activity performed by instances executing within the PES to data describing known undesirable computing activity. Once compromised instances have been identified, other previously unknown undesirable computing activity performed by the compromised instances can be identified by determining whether activity is performed by the compromised instances significantly more often than other instances executing within the PES. New undesirable computing activity discovered using this process could then be utilized to discover other compromised instances.",
	"url": null,
	"owner": "Amazon Technologies, Inc.",
	"publication_number": "08938803",
	"publication_date": "2015-01-20",
	"application_number": "13165336",
	"application_date": "2011-06-21",
	"tags": null,
	"slug": "detecting-undesirable-computing-activity",
	"match_type": "description"
},
{
	"name": "Distributed storage of aggregated data",
	"summary": "",
	"abstract": "Techniques are described for managing aggregation of data in a distributed manner, such as for a particular client based on specified configuration information. The described techniques may include storing aggregated data values for an OLAP cube or other data structure in a distributed manner, such as in some situations in a distributed hash table. The aggregated data values to be stored may be generated in various manners, such as by performing multi-stage data manipulation operationsu2014for example, a map-reduce architecture may be used, with a first stage involving the use of one or more specified map functions to be performed, and with at least a second stage involving the use of one or more specified reduce functions to be performed.",
	"url": null,
	"owner": "Amazon Technologies, Inc.",
	"publication_number": "08938416",
	"publication_date": "2015-01-20",
	"application_number": "13350653",
	"application_date": "2012-01-13",
	"tags": null,
	"slug": "distributed-storage-of-aggregated-data",
	"match_type": "description"
},
{
	"name": "Dynamic data loss prevention in a multi-tenant environment",
	"summary": "",
	"abstract": "The usage of data in a multi-tenant environment can be controlled by utilizing functionality at the hypervisor level of various resources in the environment. Data can be associated with various tags, security levels, and/or compartments. The ability of resources or entities to access the data can depend at least in part upon whether the resources or entities are also associated with the tags, security levels, and/or compartments. Limitations on the usage of the data can be controlled by one or more policies associated with the tags, security levels, and/or compartments. A control service can monitor traffic to enforce the appropriate rules or policies, and in some cases can prevent encrypted traffic from passing beyond a specified egress point unless the encryption was performed by a trusted resource with the appropriate permissions.",
	"url": null,
	"owner": "Amazon Technologies, Inc.",
	"publication_number": "08938775",
	"publication_date": "2015-01-20",
	"application_number": "13535139",
	"application_date": "2012-06-27",
	"tags": null,
	"slug": "dynamic-data-loss-prevention-in-a-multitenant-environment",
	"match_type": "description"
},
{
	"name": "Fulfillment of requests for computing capacity",
	"summary": "",
	"abstract": "Disclosed are various embodiments relating to fulfillment of requests for computing capacity. Multiple requests for allocating computing resources for customers are obtained. Each request specifies an availability time at which the computing resource is to be made available to the customer, a device parameter to select a type of computing device to provide the computing resource, a location parameter to select a location where the computing resource is to be physically located, and/or other parameters. The computing resources are allocated to the customers according to one or more allocation rules, the availability times, device parameters, location parameters, and/or other parameters.",
	"url": null,
	"owner": "Amazon Technologies, Inc.",
	"publication_number": "08938542",
	"publication_date": "2015-01-20",
	"application_number": "14269985",
	"application_date": "2014-05-05",
	"tags": null,
	"slug": "fulfillment-of-requests-for-computing-capacity",
	"match_type": "description"
},
{
	"name": "Managing communications for modified computer networks",
	"summary": "",
	"abstract": "Techniques are described for managing communications between multiple computing nodes, such as computing nodes that are part of a virtual computer network. In some situations, various types of modifications may be made to one or more computing nodes of an existing virtual computer network, and the described techniques include managing ongoing communications for those computing nodes so as to accommodate the modifications. Such modifications may include, for example, migrating or otherwise moving a particular computing node that is part of a virtual network to a new physical network location, or modifying other aspects of how the computing node participates in the virtual network (e.g., changing one or more virtual network addresses used by the computing node). In some situations, the computing nodes may include virtual machine nodes hosted on one or more physical computing machines or systems, such as by or on behalf of one or more users.",
	"url": null,
	"owner": "Amazon Technologies, Inc.",
	"publication_number": "08937960",
	"publication_date": "2015-01-20",
	"application_number": "14265159",
	"application_date": "2014-04-29",
	"tags": null,
	"slug": "managing-communications-for-modified-computer-networks",
	"match_type": "description"
},
{
	"name": "Managing I/O operations in a virtualized environment",
	"summary": "",
	"abstract": "A set of techniques is described for performing input/output (I/O) between a guest domain and a host domain in a virtualized environment. A pool of memory buffers is reserved for performing virtualized I/O operations. The reserved pool of memory buffers has static mappings that grant access to both the guest domain and the host domain. When a request to perform an I/O operation is received, the system can determine whether the memory buffers allocated to the I/O operation belong to the reserved pool. If the buffers are in the reserved pool, the host domain executes the I/O operation using the buffers without the need to map/unmap the buffers and perform TLB flushes. If the buffers are not in the reserved pool, the system can either copy the data into the reserved pool or perform the mapping and unmapping of the memory buffers to the address space of the host domain.",
	"url": null,
	"owner": "Amazon Technologies, Inc.",
	"publication_number": "08938571",
	"publication_date": "2015-01-20",
	"application_number": "13495708",
	"application_date": "2012-06-13",
	"tags": null,
	"slug": "managing-io-operations-in-a-virtualized-environment",
	"match_type": "description"
},
{
	"name": "System, method, and computer program for processing a charge for a telecommunication based on billing groups of parties to the telecommunication",
	"summary": "",
	"abstract": "A system, method, and computer program product are provided for processing a charge for a telecommunication. In use, a telecommunication from a service subscriber to a recipient is received. Additionally, it is determined whether both the service subscriber and the recipient are included within one or more billing groups. Further, a charge for the telecommunication is processed, based on the determining.",
	"url": null,
	"owner": "Amdocs Software Systems Limited",
	"publication_number": "08938213",
	"publication_date": "2015-01-20",
	"application_number": "13048813",
	"application_date": "2011-03-15",
	"tags": null,
	"slug": "system-method-and-computer-program-for-processing-a-charge-for-a-telecommunication-based-on-billing-groups-of-parties-to-the-telecommunication",
	"match_type": "description"
},
{
	"name": "System and method for secure binding of client calls and server functions",
	"summary": "",
	"abstract": "A system and method for secure binding of client calls and server functions is disclosed herein. On a server-side, the present invention alters the proxy codes of client-side JavaScript code of a Web-page. The present invention alters the name of each of the proxy codes at a predetermined time generate altered proxy codes.",
	"url": null,
	"owner": "Appcelerator, Inc.",
	"publication_number": "08938491",
	"publication_date": "2015-01-20",
	"application_number": "12326111",
	"application_date": "2008-12-02",
	"tags": null,
	"slug": "system-and-method-for-secure-binding-of-client-calls-and-server-functions",
	"match_type": "description"
},
{
	"name": "Systems and methods for counteracting a perceptual fading of a movable indicator",
	"summary": "",
	"abstract": "Systems and methods are provided for altering the position or visual appearance of a movable indicator in a GUI that is controlled by eye tracking to counteract a perceptual fading of the movable indicator with respect to the GUI. The position of the user's point of gaze may be tracked, the movable indicator may be rendering at a position associated with the user's point of gaze, and the position or visual appearance of the movable indicator may be altered when an event, such as a passage of time or a blinking of the user's eyes, is detected.",
	"url": null,
	"owner": "Apple Inc.",
	"publication_number": "08937591",
	"publication_date": "2015-01-20",
	"application_number": "13441654",
	"application_date": "2012-04-06",
	"tags": null,
	"slug": "systems-and-methods-for-counteracting-a-perceptual-fading-of-a-movable-indicator",
	"match_type": "description"
},
{
	"name": "Code planning for wireless communications",
	"summary": "",
	"abstract": "Scrambling code conflicts can be mitigated by primary scrambling code reuse that minimizing a potential interference Primary scrambling codes are applied to a first set of cells located in a portion of the network being considered. A second set of cells are evaluated for primary scrambling code reuse based on a distance parameter and/or a coverage area. If the distance parameter is greater than a defined distance, primary scrambling code reuse can be applied. If all distance parameters evaluated are less than the distance parameter, a length of the distance parameter is reduced and the distance between cells is reevaluated.",
	"url": null,
	"owner": "AT&T Intellectual Property I, L.P.",
	"publication_number": "08937934",
	"publication_date": "2015-01-20",
	"application_number": "14253768",
	"application_date": "2014-04-15",
	"tags": null,
	"slug": "code-planning-for-wireless-communications",
	"match_type": "description"
},
{
	"name": "System and method to troubleshoot a set top box device",
	"summary": "",
	"abstract": "A computer-implemented method includes receiving, at a monitoring center of a media distribution network, from a set top box device associated with a customer account, first error data indicating occurrence of a first error at the set top box device at a first time. The set top box device is at least partially functional after occurrence of the first error. The computer-implemented method includes receiving, at the monitoring center, second error data indicating occurrence of a second error at the set top box device at a second time. The set top box device is at least partially functional after occurrence of the second error. The computer-implemented method includes determining an elapsed time between the first time and the second time. The computer-implemented method includes automatically generating a trouble ticket indicating failure of the set top box device when the elapsed time satisfies a first threshold.",
	"url": null,
	"owner": "AT&T Intellectual Property I, L.P.",
	"publication_number": "08938749",
	"publication_date": "2015-01-20",
	"application_number": "12872393",
	"application_date": "2010-08-31",
	"tags": null,
	"slug": "system-and-method-to-troubleshoot-a-set-top-box-device",
	"match_type": "description"
},
{
	"name": "Evaluating targeting quality ratings and predicting potential reach of alerts in a mass notification system",
	"summary": "",
	"abstract": "A system and a method are disclosed for predicting potential reach of an alert to a targeted audience, targeted personal delivery devices and targeted non-personal notification delivery devices in an emergency mass notification system. The method includes receiving audience data which defines at least one of a set of users and a set of devices. The method further comprises evaluating a contact, tracking, or real-time targeting quality rating based on the received audience data and a data sources repository. Based on the evaluation, a prediction of the potential reach of the alert is generated and outputted.",
	"url": null,
	"owner": "AtHoc, Inc.",
	"publication_number": "08937548",
	"publication_date": "2015-01-20",
	"application_number": "13975202",
	"application_date": "2013-08-23",
	"tags": null,
	"slug": "evaluating-targeting-quality-ratings-and-predicting-potential-reach-of-alerts-in-a-mass-notification-system",
	"match_type": "description"
},
{
	"name": "System and method for providing loyalty-based virtual objects across various media including gaming devices",
	"summary": "",
	"abstract": "Gaming systems and methods are set forth designed to promote user loyalty with an enterprise. The user obtains a virtual object such as a virtual dog and earns the ability to acquire accessories or upgrades for their virtual dog through interaction with the enterprise. Certain accessories or upgrades may only be acquired or restored at a physical, brick and mortar venue for the enterprise to encourage the user to visit the venue. Acquisition of attributes such as accessories and upgrades may provide a basis for tournaments and prizes. The virtual object may be accessed and displayed at terminals at the venue or at remote devices. Acquisition of virtual objects may be used to qualify the user for a feature such as a progressive jackpot game.",
	"url": null,
	"owner": "Bally Gaming, Inc.",
	"publication_number": "08926425",
	"publication_date": "2015-01-06",
	"application_number": "13855356",
	"application_date": "2013-04-02",
	"tags": null,
	"slug": "system-and-method-for-providing-loyaltybased-virtual-objects-across-various-media-including-gaming-devices",
	"match_type": "description"
},
{
	"name": "Indicating the progress of a boot sequence on a communication device",
	"summary": "",
	"abstract": "Disclosed is a method of indicating the progress of a boot sequence on a communication device, the method comprising initiating the boot sequence; receiving input at the communication device during the boot sequence; and, in response to receiving input, outputting a progress indicator indicating the progress of the boot sequence.",
	"url": null,
	"owner": "BlackBerry Limited",
	"publication_number": "08937556",
	"publication_date": "2015-01-20",
	"application_number": "13531164",
	"application_date": "2012-06-22",
	"tags": null,
	"slug": "indicating-the-progress-of-a-boot-sequence-on-a-communication-device",
	"match_type": "description"
},
{
	"name": "Simulated incident light meter on a mobile device for photography/cinematography",
	"summary": "",
	"abstract": "A mobile telecommunications device is provided. The mobile telecommunications device comprises a light sensor and a calculation component. Adjustments to at least one of the brightness of a display screen on the mobile telecommunications device and the backlighting of a keypad on the mobile telecommunications device are based on light sensed by the light sensor. The calculation component is configured to receive a light level measurement from the light sensor and generate a photography-related output based on the light level measurement.",
	"url": null,
	"owner": "BlackBerry Limited",
	"publication_number": "08937675",
	"publication_date": "2015-01-20",
	"application_number": "13035131",
	"application_date": "2011-02-25",
	"tags": null,
	"slug": "simulated-incident-light-meter-on-a-mobile-device-for-photographycinematography",
	"match_type": "description"
},
{
	"name": "System and method for providing secure access to a remote file",
	"summary": "",
	"abstract": "A method and system for providing secure access to a remote file is disclosed. According to one embodiment, a portable memory device containing a secure desktop is provided to a user. The user has a user device that removably accepts the portable memory device. The user is allowed to securely access a dedicated storage of the cloud storage system that is created at a request from an administrator. The secure desktop runs independently from a user desktop of the user device. The user's access to a local storage of the user device is blocked while the secure desktop is running.",
	"url": null,
	"owner": "Brainzsquare Inc.",
	"publication_number": "08938790",
	"publication_date": "2015-01-20",
	"application_number": "13677189",
	"application_date": "2012-11-14",
	"tags": null,
	"slug": "system-and-method-for-providing-secure-access-to-a-remote-file",
	"match_type": "description"
},
{
	"name": "Non-transitory storage medium storing image-forming-data transmitting program, mobile terminal, and control method therefor transmitting movement and orientation information of mobile terminal",
	"summary": "",
	"abstract": "A nonvolatile storage medium storing an image-forming-data transmitting program readable by a computer of a mobile terminal including: a sensor for outputting sensor information indicating at least one of a movement and an orientation of the mobile terminal; a communication portion for communicating with an image forming apparatus for forming image based on image forming data; and a display for displaying an image based on image data. The image-forming-data transmitting program has the computer function as: a parameter determining section for determining a parameter for image forming based on the sensor information; an image-forming-data-creation controlling section for controlling a first creating section to create image forming data based on the image data, by using the determined parameter; and an image-forming-data-transmission controlling section for controlling the communication portion to transmit the created image forming data to the image forming apparatus.",
	"url": null,
	"owner": "Brother Kogyo Kabushiki Kaisha",
	"publication_number": "08937735",
	"publication_date": "2015-01-20",
	"application_number": "13361889",
	"application_date": "2012-01-30",
	"tags": null,
	"slug": "nontransitory-storage-medium-storing-imageformingdata-transmitting-program-mobile-terminal-and-control-method-therefor-transmitting-movement-and-orientation-information-of-mobile-terminal",
	"match_type": "description"
},
{
	"name": "Game of chance systems and methods",
	"summary": "",
	"abstract": "In various embodiments, players may compete in a gaming context.",
	"url": null,
	"owner": "CFPH, LLC",
	"publication_number": "08932124",
	"publication_date": "2015-01-13",
	"application_number": "12962828",
	"application_date": "2010-12-08",
	"tags": null,
	"slug": "game-of-chance-systems-and-methods",
	"match_type": "description"
},
{
	"name": "Intelligent social collaboration hover card",
	"summary": "",
	"abstract": "In one embodiment, a method includes generating a hover card associated with an entity in response to a user of a software application hovering a pointer over a reference to the entity within a graphical user interface (GUI) presented to the user by the software application. The hover card includes a photograph or icon representing the entity, a name of the entity, and a plurality of unified communications (UC) icons that are each configured to attempt to establish a particular type of communication session between the user and the entity. The method further includes presenting the hover card to the first user proximate to the pointer.",
	"url": null,
	"owner": "Cisco Technology, Inc.",
	"publication_number": "08938690",
	"publication_date": "2015-01-20",
	"application_number": "12946791",
	"application_date": "2010-11-15",
	"tags": null,
	"slug": "intelligent-social-collaboration-hover-card",
	"match_type": "description"
},
{
	"name": "Methods and systems for providing, to a first application executed by a first operating system, an interface for communicating with at least one application executed by a second operating system",
	"summary": "",
	"abstract": "A method for providing, to a first application executed by a first operating system, an interface for communicating with at least one application executed by a second operating system includes providing, by a first interface object executed by the first operating system, a mechanism for external communication with a first application executed by the first operating system. A second interface object executed by the second operating system provides a mechanism for external communication with a window handler executed by the second operating system. The first interface object receives an identification of a window displayed by the first operating system and generated by a second application executed by the second operating system and requests, from the second interface object, analysis of the identified window. The first interface object receives, from the second interface object, an identification of contact information displayed by the window resulting from the analysis by the window handler.",
	"url": null,
	"owner": "Citrix Systems, Inc.",
	"publication_number": "08938743",
	"publication_date": "2015-01-20",
	"application_number": "12341797",
	"application_date": "2008-12-22",
	"tags": null,
	"slug": "methods-and-systems-for-providing-to-a-first-application-executed-by-a-first-operating-system-an-interface-for-communicating-with-at-least-one-application-executed-by-a-second-operating-system",
	"match_type": "description"
},
{
	"name": "Profiling and tracking vehicles using cameras",
	"summary": "",
	"abstract": "Profiling and tracking vehicles using cameras is disclosed. Initially, two or more first images from a first camera having a first field of view are received. A first static characteristic of a first vehicle is determined based on at least one of the two or more first images. Next, a desired static characteristic of a vehicle of interest is received. The desired static characteristic of the vehicle of interest is compared with the first static characteristic of the first vehicle. In response to the comparison, it is determined that the desired static characteristic of the vehicle of interest is approximately equal to the first static characteristic of the first vehicle. In response, it is determined that the vehicle of interest is present in the first field of view of the first camera. Finally, it is indicated that the vehicle of interest is present in the first field of view.",
	"url": null,
	"owner": "Cloudparc, Inc.",
	"publication_number": "08937660",
	"publication_date": "2015-01-20",
	"application_number": "14244027",
	"application_date": "2014-04-03",
	"tags": null,
	"slug": "profiling-and-tracking-vehicles-using-cameras",
	"match_type": "description"
},
{
	"name": "Method for accessing service resource items that are for use in a telecommunications system",
	"summary": "",
	"abstract": "Service resource items for use in call setup in a telephone system are held on servers that are connected to a computer network which is logically distinct from the telephone system infrastructure; this computer network may, for example, make use of the Internet. Each service item is locatable on the network at a corresponding URI and is associated with a particular telephone number. A mapping is provided between telephone numbers and the URIs of associated service resource items. When it is desired to access a service resource item associated with a particular telephone number, this mapping is used to retrieve the corresponding URI which is then used to access the desired service resource item.",
	"url": null,
	"owner": "Comcast IP Holdings I, LLC",
	"publication_number": "08938062",
	"publication_date": "2015-01-20",
	"application_number": "13525454",
	"application_date": "2012-06-18",
	"tags": null,
	"slug": "method-for-accessing-service-resource-items-that-are-for-use-in-a-telecommunications-system",
	"match_type": "description"
},
{
	"name": "Generic file level restore from a block-level secondary copy",
	"summary": "",
	"abstract": "Systems and methods are provided which perform a file level restore by utilizing existing operating system components (e.g., file system drivers) that are natively installed on the target computing device. These components can be used to mount and/or interpret a secondary copy of the file system. For instance, the system can instantiate an interface object (e.g., a device node such as a pseudo device, device file or special file) on the target client which includes file system metadata corresponding to the backed up version of the file system. The interface provides a mechanism for the operating system to mount the secondary copy and perform file level access on the secondary copy, e.g., to restore one or more selected files.",
	"url": null,
	"owner": "CommVault Systems, Inc.",
	"publication_number": "08938481",
	"publication_date": "2015-01-20",
	"application_number": "13794357",
	"application_date": "2013-03-11",
	"tags": null,
	"slug": "generic-file-level-restore-from-a-blocklevel-secondary-copy",
	"match_type": "description"
},
{
	"name": "Patient-adapted and improved articular implants, designs and related guide tools",
	"summary": "",
	"abstract": "Methods and devices are disclosed relating improved articular models, implant components, and related guide tools and procedures. In addition, methods and devices are disclosed relating articular models, implant components, and/or related guide tools and procedures that include one or more features derived from patient-data, for example, images of the patient's joint. The data can be used to create a model for analyzing a patient's joint and to devise and evaluate a course of corrective action. The data also can be used to create patient-adapted implant components and related tools and procedures.",
	"url": null,
	"owner": "ConforMIS, Inc.",
	"publication_number": "08926706",
	"publication_date": "2015-01-06",
	"application_number": "13294579",
	"application_date": "2011-11-11",
	"tags": null,
	"slug": "patientadapted-and-improved-articular-implants-designs-and-related-guide-tools",
	"match_type": "description"
},
{
	"name": "Techniques of optical proximity correction using GPU",
	"summary": "",
	"abstract": "Computationally intensive electronic design automation operations are accelerated with algorithms utilizing one or more graphics processing units. The optical proximity correction (OPC) process calculates, improves, and optimizes one or more features on an exposure mask (used in semiconductor or other processing) so that a resulting structure realized on an integrated circuit or chip meets desired design and performance requirements. When a chip has billions of transistors or more, each with many fine structures, the computational requirements for OPC can be very large. This processing can be accelerated using one or more graphics processing units.",
	"url": null,
	"owner": "D2S, Inc.",
	"publication_number": "08938696",
	"publication_date": "2015-01-20",
	"application_number": "13942395",
	"application_date": "2013-07-15",
	"tags": null,
	"slug": "techniques-of-optical-proximity-correction-using-gpu",
	"match_type": "description"
},
{
	"name": "Healthcare service integration software development system and method therefor",
	"summary": "",
	"abstract": "A method includes providing a graphical user interface to an automated software development system, and providing a customized software application to an enterprise. The application comprises a collection of codesets that together are configured to perform an integration process. The system provides a configuration dialog interface for soliciting, from a user, information indicating a Health Level Seven (HL7) version and an HL7 message type. The system determines an HL7 electronic data interchange document profile defining a document schema and a set of data elements included at an HL7 message document corresponding to the HL7 version and the HL7 message type. The system generates a profile codeset based on the HL7 document profile. The system provides the customized software application for installation at an enterprise, the application comprising a collection of codesets including the profile codeset.",
	"url": null,
	"owner": "Dell Products, LP",
	"publication_number": "08938711",
	"publication_date": "2015-01-20",
	"application_number": "13862948",
	"application_date": "2013-04-15",
	"tags": null,
	"slug": "healthcare-service-integration-software-development-system-and-method-therefor",
	"match_type": "description"
},
{
	"name": "System and method for I/O port assignment and security policy application in a client hosted virtualization system",
	"summary": "",
	"abstract": "A client hosted virtualization system includes a processor and non-volatile memory with BIOS code and virtualization manager code. The virtualization manager initializes the client hosted virtualization system, authenticates a virtual machine image, launches the virtual machine based on the image, and implements a policy manager. The policy manager determines a policy for the virtual machine, receives a request to access a device from the virtual machine, determines if the virtual machine is permitted to access the device based upon the policy, and if so, permits the virtual machine to access the device. If not, the policy manager denies the virtual machine access to the device. The client hosted virtualization system is configurable to execute the BIOS or the virtualization manager.",
	"url": null,
	"owner": "Dell Products, LP",
	"publication_number": "08938774",
	"publication_date": "2015-01-20",
	"application_number": "12790550",
	"application_date": "2010-05-28",
	"tags": null,
	"slug": "system-and-method-for-io-port-assignment-and-security-policy-application-in-a-client-hosted-virtualization-system",
	"match_type": "description"
},
{
	"name": "Resource allocating apparatus and method for machine type communication",
	"summary": "",
	"abstract": "There are provided a resource allocating method for machine type communication (MTC), a data transmission and reception method for an MTC device, and an MTC device using the data transmission and reception method. The transmission and reception method for the MTC device includes: receiving a downlink frame from a base station; searching for a control information block in a downlink control resource area of the downlink frame; determining whether the control information block is for MTC service or includes control information whose destination is the MTC device, using an MTC device identifier or an identifier designated for MTC service scheduling; and extracting MTC service packet data included in a radio resource for transmission of MTC data, using the control information block, according to the results of the determination.",
	"url": null,
	"owner": "Electronics and Telecommunications Research Institute",
	"publication_number": "08937916",
	"publication_date": "2015-01-20",
	"application_number": "13626152",
	"application_date": "2012-09-25",
	"tags": null,
	"slug": "resource-allocating-apparatus-and-method-for-machine-type-communication",
	"match_type": "description"
},
{
	"name": "User generated data center power savings",
	"summary": "",
	"abstract": "Technologies are described herein for providing power savings in a data center. Some example technologies may identify some user-provided hardware independent power saving codes from multiple virtual machines within the data center. The technologies may convert at least a portion of the user-provided hardware independent power saving codes into a device power management message specific to a computing system in the data center. The technologies may provide the device power management message to the computing system. The computing system may be configured to enable or disable one or more devices within the computing system according to the device power management message.",
	"url": null,
	"owner": "Empire Technology Development LLC",
	"publication_number": "08938634",
	"publication_date": "2015-01-20",
	"application_number": "13514337",
	"application_date": "2012-01-25",
	"tags": null,
	"slug": "user-generated-data-center-power-savings",
	"match_type": "description"
},
{
	"name": "Network bandwidth regulation using traffic scheduling",
	"summary": "",
	"abstract": "Disclosed herein are systems and methods for regulating network bandwidth by means of monitoring network traffic, predicting network loads, and scheduling traffic utilizing traffic reporting and bandwidth reservation mechanisms. These systems and methods may reduce network congestion and support more efficient processing by network applications. Traffic reporting may comprise broadcasting control messages to network nodes indicating appropriate times to send and receive messages. Network nodes may use traffic reports (e.g., control messages) to proactively regulate their use of the network. Bandwidth reservation may allow network nodes to do productive processing while waiting to send and receive data, and may decrease mean wait times. Reservations may be implemented in a synchronous or asynchronous manner. In an exemplary embodiment, the reservation mechanism may emulate a traditional stream socket API. Embodiments enabling enhanced TV applications to run more effectively over cable TV out-of-band networks are described.",
	"url": null,
	"owner": "FourthWall Media",
	"publication_number": "08937866",
	"publication_date": "2015-01-20",
	"application_number": "13660476",
	"application_date": "2012-10-25",
	"tags": null,
	"slug": "network-bandwidth-regulation-using-traffic-scheduling",
	"match_type": "description"
},
{
	"name": "Optimizing search engine ranking by recommending content including frequently searched questions",
	"summary": "",
	"abstract": "Systems and method of the present invention provide for one or more server computers configured to receive one or more keywords topically relevant to a content of a web page, request from a search engine a first metric comprising a quantity of times the keywords have appeared in a search query with one or more question keywords during a time period and a second metric comprising a probability of receiving a high rank associated with the one or more keywords and the one or more question keywords, receive, from the search engine, the first metric and the second metric, calculate a keyword effectiveness index from the first metric and the second metric, and generate and transmit to a client computer one or more recommendations to include a high ranked suggested content on the web page according to the keyword effectiveness index.",
	"url": null,
	"owner": "Go Daddy Operating Company, LLC",
	"publication_number": "08938438",
	"publication_date": "2015-01-20",
	"application_number": "13650066",
	"application_date": "2012-10-11",
	"tags": null,
	"slug": "optimizing-search-engine-ranking-by-recommending-content-including-frequently-searched-questions",
	"match_type": "description"
},
{
	"name": "Data abstraction layer for interfacing with reporting systems",
	"summary": "",
	"abstract": "A data transformation system receives data from one or more external source systems and stores and transforms the data for providing to reporting systems. The data transformation system maintains multiple versions of data received from an external source system. The data transformation system can combine data from different versions of data and provide to the reporting system. As a result, external source systems that do not maintain data in a format appropriate for reporting systems and/or do not maintain sufficient historical data to generate different types of reports are able to generate these reports. The data transformation system can also enhance older versions of data stored in the system or exclude portions of data from reports. The data transformation system can purge older versions of data so that older data that is less frequently requested is maintained at a lower frequency than recent data.",
	"url": null,
	"owner": "GoodData Corporation",
	"publication_number": "08938414",
	"publication_date": "2015-01-20",
	"application_number": "14297442",
	"application_date": "2014-06-05",
	"tags": null,
	"slug": "data-abstraction-layer-for-interfacing-with-reporting-systems",
	"match_type": "description"
},
{
	"name": "Generating globally coherent timestamps",
	"summary": "",
	"abstract": "The present technology proposes techniques for generating globally coherent timestamps. This technology may allow distributed systems to causally order transactions without incurring various types of communication delays inherent in explicit synchronization. By globally deploying a number of time masters that are based on various types of time references, the time masters may serve as primary time references. Through an interactive interface, the techniques may track, calculate and record data relative to each time master thus providing the distributed systems with causal timestamps.",
	"url": null,
	"owner": "Google Inc.",
	"publication_number": "08938636",
	"publication_date": "2015-01-20",
	"application_number": "13475143",
	"application_date": "2012-05-18",
	"tags": null,
	"slug": "generating-globally-coherent-timestamps",
	"match_type": "description"
},
{
	"name": "Identifying geo-located objects",
	"summary": "",
	"abstract": "A method of providing geo-coded information to a user of a graphical computing device is disclosed. The method includes receiving information identifying a view to be displayed on the graphical computing device, querying a geo-coded database containing information associated with publicly supplied models located in a geography, for one or more models located in the view, and transmitting information identifying the one or more models located in the view.",
	"url": null,
	"owner": "Google Inc.",
	"publication_number": "08938464",
	"publication_date": "2015-01-20",
	"application_number": "11740221",
	"application_date": "2007-04-25",
	"tags": null,
	"slug": "identifying-geolocated-objects",
	"match_type": "description"
},
{
	"name": "Matching views between a three-dimensional geographical image and a  two-dimensional geographical image",
	"summary": "",
	"abstract": "An apparatus determines a matching viewpoint for a geographical area displayed in three-dimensional geographical image and a corresponding two-dimensional geographical image. The apparatus may include a memory operative to store a two-dimensional geographical image and a three-dimensional geographical image. The memory may further store a transformation extension operative to interact with a host application to determine two-dimensional geographical image parameters for generating the two-dimensional geographical image from three-dimensional geographical image parameters for generating the three-dimensional geographical image. The apparatus may further include a processor operative to receive a geographical identifier for a geographical location, transmit the geographical identifier to receive two-dimensional geographical image instructions for displaying the three-dimensional geographical image, display the three-dimensional geographical image, and invoke the transformation extension to determine the two-dimensional geographical image parameters from the displayed three-dimensional geographical image. After invoking the transformation extension, the processor may then display the two-dimensional geographical image.",
	"url": null,
	"owner": "Google Inc.",
	"publication_number": "08937617",
	"publication_date": "2015-01-20",
	"application_number": "13090689",
	"application_date": "2011-04-20",
	"tags": null,
	"slug": "matching-views-between-a-threedimensional-geographical-image-and-a--twodimensional-geographical-image",
	"match_type": "description"
},
{
	"name": "Seamless vector map tiles across multiple zoom levels",
	"summary": "",
	"abstract": "Rendering map tiles with style data for zoom levels other than the style data intended for that tile at its nominal zoom level can be used to avoid abrupt changes between map tiles. Particularly when changing zoom levels, use of styles from more than one level may create an uneven look. To address this, either the new data may be displayed with the style for the previous zoom level or the old data may be presented with the style for the new zoom level style until all tiles for the new zoom level are received. At that time, all the map tiles may be displayed using the style for the new zoom level along with the map data intended for that zoom level. Displaying map tiles at a first zoom level using a progression of styles from other zoom levels may also be used when creating a perspective view map.",
	"url": null,
	"owner": "Google Inc.",
	"publication_number": "08937627",
	"publication_date": "2015-01-20",
	"application_number": "13432077",
	"application_date": "2012-03-28",
	"tags": null,
	"slug": "seamless-vector-map-tiles-across-multiple-zoom-levels",
	"match_type": "description"
},
{
	"name": "Computing device and method for wireless remote boot in a networked environment",
	"summary": "",
	"abstract": "In some embodiments, a secure authenticated remote boot of computing device over a wireless network is performed in a pre-boot execution environment (PXE) using active management technology (AMT) for remote discovery. In these embodiments, a management engine (ME) may maintain full control of a wireless interface and a wireless connection as booting begins. The ME may relinquish control of the wireless interface after a PXE timeout, in response to a shutdown command, or once the device has booted. The ME controls the use of an operating system received from a remote location.",
	"url": null,
	"owner": "Intel Corporation",
	"publication_number": "08938610",
	"publication_date": "2015-01-20",
	"application_number": "14060289",
	"application_date": "2013-10-22",
	"tags": null,
	"slug": "computing-device-and-method-for-wireless-remote-boot-in-a-networked-environment",
	"match_type": "description"
},
{
	"name": "Scaling egress network traffic",
	"summary": "",
	"abstract": "In an embodiment, a method is provided. The method of this embodiment provides generating one or more packets of data, the one or more packets of data being associated with a connection; and associating the one or more packets with one of a plurality of transmit queues based, at least in part, on the connection associated with the one or more packets.",
	"url": null,
	"owner": "Intel Corporation",
	"publication_number": "08937944",
	"publication_date": "2015-01-20",
	"application_number": "13336497",
	"application_date": "2011-12-23",
	"tags": null,
	"slug": "scaling-egress-network-traffic",
	"match_type": "description"
},
{
	"name": "Relative touch user interface enhancements",
	"summary": "",
	"abstract": "Some embodiments provide a meta touch interface (MTI) with multiple position indicators with each position indicator operating as a separate pointing tool that can be activated (i) using taps on a touchpad or other touch sensitive surface or (ii) by pressing certain keyboard keys. The MT pointer allows for adjacent UI elements to be selected without having to reposition the MT pointer for each selection or activation. Some embodiments provide a multi-device UI that comprises at least two UIs, wherein the first UI is presented on an essentially horizontal plane that is aligned with operational focus and the second UI that is presented on an essentially vertical plane that is aligned with visual focus of the user. Some embodiments provide a precision pointer that includes an adjustable magnified region to better present underlying on-screen content, thereby allowing the user to more precisely position the pointer.",
	"url": null,
	"owner": "Intellitact LLC",
	"publication_number": "08933888",
	"publication_date": "2015-01-13",
	"application_number": "13490113",
	"application_date": "2012-06-06",
	"tags": null,
	"slug": "relative-touch-user-interface-enhancements",
	"match_type": "description"
},
{
	"name": "Energy efficient implementation of read-copy update for light workloads running on systems with many processors",
	"summary": "",
	"abstract": "A technique for determining if a processor in a multiprocessor system implementing a read-copy update (RCU) subsystem may be placed in a low power state. The technique may include performing a first predictive query of the RCU subsystem to request permission for the processor to enter the low power state. If permission is denied, the processor is not placed in the low power state. If permission is granted, the processor is placed in the low power state for a non-fixed duration. Regardless whether permission is denied or granted, a second confirming query of the RCU subsystem is performed to redetermined whether it is permissible for the processor to be in the low power state.",
	"url": null,
	"owner": "International Business Machines Corporation",
	"publication_number": "08938631",
	"publication_date": "2015-01-20",
	"application_number": "13539363",
	"application_date": "2012-06-30",
	"tags": null,
	"slug": "energy-efficient-implementation-of-readcopy-update-for-light-workloads-running-on-systems-with-many-processors",
	"match_type": "description"
},
{
	"name": "Securing application information in system-wide search engines",
	"summary": "",
	"abstract": "A system for securing application information in a shared, system-wide search service. Each application can register a security filtering module that is to be used at search time to filter data associated with that application. When a user performs a search, initial, unfiltered search results are obtained based the contents of the shared search index. The unfiltered search results are organized by application, and previously registered filter modules are called to perform user specific, per-application filtering on the initial results. The filter modules cause data to which the user issuing the search request does not have access to be removed from the search results, on a per application basis. Those of the initial search results that are determined in this way to not be accessible to the user issuing the search request are removed, resulting in a set of filtered search results that are presented to the user. The filtered search results thus contain indications only of data that is accessible to the user. In this way, the system-wide search service filters search results to remove indications of data which match the search criteria provided by the user, but to which the user does not have access, based on a conveniently extensible, per-application search result filtering process.",
	"url": null,
	"owner": "International Business Machines Corporation",
	"publication_number": "08938474",
	"publication_date": "2015-01-20",
	"application_number": "11462937",
	"application_date": "2006-08-07",
	"tags": null,
	"slug": "securing-application-information-in-systemwide-search-engines",
	"match_type": "description"
},
{
	"name": "Tiered XML services in a content management system",
	"summary": "",
	"abstract": "A content management system (CMS) includes a value-add application with a first set of XML content services, one or more dedicated XML processing servers with a second and other sets of XML content services, and a core CMS with a third set of XML content services. The content management system may be designed to provide XML content services at any of these three tiers of processing. A first threshold is defined that allows the value-add application to determine when to offload XML content services to a dedicated XML processing server. A second threshold is defined that allows the core CMS to determine when to offload XML content services to a dedicated XML processing server. Callback services are included that allow each tier of XML content services to send or receive additional information to complete the XML processing. The result is a content management system that is very powerful and flexible.",
	"url": null,
	"owner": "International Business Machines Corporation",
	"publication_number": "08938522",
	"publication_date": "2015-01-20",
	"application_number": "13753763",
	"application_date": "2013-01-30",
	"tags": null,
	"slug": "tiered-xml-services-in-a-content-management-system",
	"match_type": "description"
},
{
	"name": "Tracking ownership of memory in a data processing system through use of a memory monitor",
	"summary": "",
	"abstract": "Ownership of a memory unit in a data processing system is tracked by assigning an identifier to each software component in the data processing system that can acquire ownership of the memory unit. An ownership variable is updated with the identifier of the software component that acquires ownership of the memory unit whenever the memory unit is acquired.",
	"url": null,
	"owner": "International Business Machines Corporation",
	"publication_number": "08938593",
	"publication_date": "2015-01-20",
	"application_number": "13971545",
	"application_date": "2013-08-20",
	"tags": null,
	"slug": "tracking-ownership-of-memory-in-a-data-processing-system-through-use-of-a-memory-monitor",
	"match_type": "description"
},
{
	"name": "System and method for connecting, configuring and testing wireless devices and applications",
	"summary": "",
	"abstract": "A system, apparatus, and method are provided for connecting, configuring and testing wireless devices and applications. For example, one embodiment of wireless device for operation in a wireless network comprises a processor, a wireless module including a radio receiver and transmitter unit coupled to the processor, a graphical user interface (GUI) coupled to the processor, and a Connection Manager Module (CMM) including an Application Programming Interface (API) module, a Rules Engine Module, and a Rules Set Module, wherein the CMM manages a connection to a wireless network.",
	"url": null,
	"owner": "Jasper Technologies, Inc.",
	"publication_number": "08937910",
	"publication_date": "2015-01-20",
	"application_number": "14477614",
	"application_date": "2014-09-04",
	"tags": null,
	"slug": "system-and-method-for-connecting-configuring-and-testing-wireless-devices-and-applications",
	"match_type": "abstract"
},
{
	"name": "Dynamically adjusting hash table capacity",
	"summary": "",
	"abstract": "An example hashing unit includes a plurality of hardware-based hash tables, wherein each of the hash tables comprises a plurality of buckets, and wherein the plurality of hash tables comprise a set of zero or more active hash tables and a set of one or more inactive hash tables. An example hashing unit controller is configured to receive a key value to be stored in the hashing unit, determine that one of the inactive hash tables should be activated, and, based on the determination, activate the one of the set of inactive hash tables as a recently activated hash table, determine one of the buckets of the recently activated hash table to which a hash function associated with the recently activated hash table maps the received key value, and store the key value in the determined one of the buckets of the recently activated hash table.",
	"url": null,
	"owner": "Juniper Networks, Inc.",
	"publication_number": "08938469",
	"publication_date": "2015-01-20",
	"application_number": "13239774",
	"application_date": "2011-09-22",
	"tags": null,
	"slug": "dynamically-adjusting-hash-table-capacity",
	"match_type": "description"
},
{
	"name": "Apparatus and method for processing an interactive service",
	"summary": "",
	"abstract": "A method of processing an interactive service and an apparatus thereof are disclosed. The present invention includes generating an application parameter table which includes information about at least one of applications, wherein the application parameter table includes a first identifier and a second identifier, wherein the first identifier identifies a interactive programming segment which application parameter table pertains to, and wherein the second identifier identifies an application within the scope of application parameter table; generating an activation message file that indicates at least one of activation times of the applications, wherein the activation message file includes a third identifier and activation messages, wherein the third identifier matches the first identifier of application parameter table which contains the applications, wherein the activation message includes a fourth identifier and a start time information, wherein the fourth identifier matches the second identifier of the application in the application parameter table, and wherein the start time information indicates the start time for an event targeted to the application relative to segment time; generating a multi-part message with the application parameter table as the first part and the activation message file as the second part; and transmitting the multi-part message to receiver via HTTP.",
	"url": null,
	"owner": "LG Electronics Inc.",
	"publication_number": "08938752",
	"publication_date": "2015-01-20",
	"application_number": "14213455",
	"application_date": "2014-03-14",
	"tags": null,
	"slug": "apparatus-and-method-for-processing-an-interactive-service",
	"match_type": "description"
},
{
	"name": "System and method for storing/caching, searching for, and accessing data",
	"summary": "",
	"abstract": "A system for persistently maintaining data using a network for data packets is provided. The system includes a transmission medium associated with the network, a plurality of switches operatively connected to the transmission medium. Each switch has an intelligent network controller adapted for delivering the data packets to a device operatively connected to the intelligent network controller in response to a request for the data packets from the device and further adapted for re-transmitting unexpired data packets over the network.",
	"url": null,
	"owner": "Lightwaves Systems, Inc.",
	"publication_number": "08937967",
	"publication_date": "2015-01-20",
	"application_number": "14016358",
	"application_date": "2013-09-03",
	"tags": null,
	"slug": "system-and-method-for-storingcaching-searching-for-and-accessing-data",
	"match_type": "description"
},
{
	"name": "Techniques for populating a content stream on a mobile device",
	"summary": "",
	"abstract": "Techniques for populating a content stream of a mobile application are described. Consistent with some embodiments, the delays associated with waiting for a server to respond to a user's manual request for content items are eliminated by using various sensors of a mobile computing device to predict when a user is likely to view a personalized content stream. Accordingly, a background process identifies when certain conditions are satisfied, and an automatic content request is communicated to a content server, such that content items for presentation to a member of a social networking service are pre-fetched.",
	"url": null,
	"owner": "LinkedIn Corporation",
	"publication_number": "08938488",
	"publication_date": "2015-01-20",
	"application_number": "14141934",
	"application_date": "2013-12-27",
	"tags": null,
	"slug": "techniques-for-populating-a-content-stream-on-a-mobile-device",
	"match_type": "description"
},
{
	"name": "User account creation involving a mobile device",
	"summary": "",
	"abstract": "Mobile devices may often communicate with network (u201ccloudu201d) services that require an account. Because it may be undesirable to require user interaction when creating an account, it may be desirable to create an account associating a mobile device to a network service without requiring a user to explicitly enter authentication information, such as a username and password. In an embodiment, data corresponding to a mobile device is obtained to generate authentication information which is then sent to messaging address of a user. In another embodiment, in response to an event, a mobile device obtains an identifier for a user, sends the identifier to a server, where the server transmits one set of authentication information to a messaging address associated with the user and another set of authentication information to the device.",
	"url": null,
	"owner": "Lookout, Inc.",
	"publication_number": "08938810",
	"publication_date": "2015-01-20",
	"application_number": "13403927",
	"application_date": "2012-02-23",
	"tags": null,
	"slug": "user-account-creation-involving-a-mobile-device",
	"match_type": "description"
},
{
	"name": "System and method for establishing data communication using pre-configured user data",
	"summary": "",
	"abstract": "Call party details of a telephone call involving first and second telephony user devices are received. The call party details include first and second identities associated with the first and second telephony user devices respectively. A client-server connection request is received from, and a client-server connection is established with, one of the user devices. A session for the communication of data to and/or from the user devices is established separately from the telephone call on the basis of the first and second identities. The receipt of pre-configured user data by the one of the user devices is enabled via the client-server connection. The pre-configured user data has been specified by a user of another of the user devices prior to the establishment of the telephone call as data for receipt by other user devices during telephone calls conducted by the user.",
	"url": null,
	"owner": "Metaswitch Networks Ltd",
	"publication_number": "08938055",
	"publication_date": "2015-01-20",
	"application_number": "13918054",
	"application_date": "2013-06-14",
	"tags": null,
	"slug": "system-and-method-for-establishing-data-communication-using-preconfigured-user-data",
	"match_type": "description"
},
{
	"name": "Encoding, updating, and decoding barcodes in a document",
	"summary": "",
	"abstract": "Method for inserting a barcode image in a document including receiving a request to encode one or more properties about the document as a barcode image in the document, the request being received through a document editor, generating the barcode image based on the properties, wrapping the barcode image inside a container object, and inserting the container object into the document.",
	"url": null,
	"owner": "Microsoft Corporation",
	"publication_number": "08925822",
	"publication_date": "2015-01-06",
	"application_number": "12236509",
	"application_date": "2008-09-24",
	"tags": null,
	"slug": "encoding-updating-and-decoding-barcodes-in-a-document",
	"match_type": "description"
},
{
	"name": "Information propagation probability for a social network",
	"summary": "",
	"abstract": "One or more techniques and/or systems are disclosed for predicting propagation of a message on a social network. A predictive model is trained to determine a probability of propagation of information on the social network using both positive and negative information propagation feedback, which may be collected while monitoring the social network over a desired period of time for information propagation. A particular message can be input to the predictive model, which can determine a probability of propagation of the message on the social network, such as how many connections may receive at least a portion of the message and/or a likelihood of at least a portion of the message reaching respective connections in the social network.",
	"url": null,
	"owner": "Microsoft Corporation",
	"publication_number": "08938407",
	"publication_date": "2015-01-20",
	"application_number": "13919088",
	"application_date": "2013-06-17",
	"tags": null,
	"slug": "information-propagation-probability-for-a-social-network",
	"match_type": "description"
},
{
	"name": "Modifying functionality based on distances between devices",
	"summary": "",
	"abstract": "Described herein are techniques and systems that allow modification of functionalities based on distances between a shared device (e.g., a shared display, etc.) and an individual device (e.g., a mobile computing device, etc.). The shared device and the individual device may establish a communication to enable exchange of data. In some embodiments, the shared device or the individual device may measure a distance between the shared device and the individual device. Based on the distance, the individual device may operate in a different mode. In some instances, the shared device may then instruct the individual device to modify a functionality corresponding to the mode.",
	"url": null,
	"owner": "Microsoft Corporation",
	"publication_number": "08938558",
	"publication_date": "2015-01-20",
	"application_number": "13830375",
	"application_date": "2013-03-14",
	"tags": null,
	"slug": "modifying-functionality-based-on-distances-between-devices",
	"match_type": "description"
},
{
	"name": "Non-blocking buffered inter-machine data transfer with acknowledgment",
	"summary": "",
	"abstract": "A system, method and data structures for transmitting batched data over a network in asynchronous, non-blocking operations, with acknowledgements returned to the senders. Each machine includes a sender subsystem and a receiver subsystem. Transmission items corresponding to data to be sent are buffered until a send is triggered, at which time the transmission items are sorted according to their destinations and sent as a GUID-identified batch to each destination by a send thread. At each receiver, a receiving thread adds descriptions of the data to a receive list, which a transfer thread processes when triggered. The transfer thread sends the corresponding data to a recipient program, and sends GUID-identified acknowledgements corresponding to each GUID back to the originating senders. An acknowledge thread at each originating sender buffers the acknowledgements, and when triggered, a cleanup thread uses the GUID to identify which batched transmissions were received.",
	"url": null,
	"owner": "Microsoft Corporation",
	"publication_number": "08938555",
	"publication_date": "2015-01-20",
	"application_number": "13911693",
	"application_date": "2013-06-06",
	"tags": null,
	"slug": "nonblocking-buffered-intermachine-data-transfer-with-acknowledgment",
	"match_type": "description"
},
{
	"name": "Recovery service location for a service",
	"summary": "",
	"abstract": "A secondary location of a network acts as a recovery network for a primary location of the service. The secondary location is maintained in a warm state that is configured to replace the primary location in a case of a failover. During normal operation, the primary location actively services user load and performs backups that include full backups, incremental backups and transaction logs that are automatically replicated to the secondary location. Information is stored (e.g. time, retry count) that may be used to assist in determining when the backups are restored correctly at the secondary location. The backups are restored and the transaction logs are replayed at the secondary location to reflect changes (content and administrative) that are made to the primary location. After failover to the secondary location, the secondary location becomes the primary location and begins to actively service the user load.",
	"url": null,
	"owner": "Microsoft Corporation",
	"publication_number": "08938638",
	"publication_date": "2015-01-20",
	"application_number": "13154299",
	"application_date": "2011-06-06",
	"tags": null,
	"slug": "recovery-service-location-for-a-service",
	"match_type": "description"
},
{
	"name": "Scale factors for visual presentations",
	"summary": "",
	"abstract": "A device may display a presentation of elements (e.g., icons) on a display component. However, display components have a pixel density that affects aesthetic and practical aspects of the presentation (e.g., rendering the presentation at a variable and inconsistent size); yet, many presentations are not generated in view of the pixel density of the display component of the device. Presented herein are techniques for generating and displaying a presentation of elements in view of the pixel density of the display component, using a scale factor set of scale factors that specify a pixel density range and a scale factor value (e.g., 120%) to be applied to the elements of the presentation. The scale factor set may be kept small to reduce the administrative burden on the designer of the element, while also achieving approximately consistent sizing of the presentation on display components having variable pixel densities.",
	"url": null,
	"owner": "Microsoft Corporation",
	"publication_number": "08933971",
	"publication_date": "2015-01-13",
	"application_number": "13230445",
	"application_date": "2011-09-12",
	"tags": null,
	"slug": "scale-factors-for-visual-presentations",
	"match_type": "description"
},
{
	"name": "Security language expressions for logic resolution",
	"summary": "",
	"abstract": "A security language expresses assertions and authorization queries in a manner that facilitates logic resolution. In an example implementation, assertion syntax and authorization query syntax are described. In another example implementation, checks on the safety of assertions and authorization queries are described. In yet another example implementation, semantics rules are described.",
	"url": null,
	"owner": "Microsoft Corporation",
	"publication_number": "08938783",
	"publication_date": "2015-01-20",
	"application_number": "11530564",
	"application_date": "2006-09-11",
	"tags": null,
	"slug": "security-language-expressions-for-logic-resolution",
	"match_type": "description"
},
{
	"name": "Shared user-mode for controlling synchronized access to a shared resource",
	"summary": "",
	"abstract": "Technologies are described herein for implementing shared locks for controlling synchronized access to a shared resource. In one method, in a user mode of an operating system, a notification is received indicating that a first process begins execution. The first process is adapted to acquire the shared lock during execution of the first process. Upon receiving the notification, it is determined whether the first process terminates execution without releasing the shared lock. Upon determining that the first process terminates execution without releasing the shared lock, the shared lock is released for access by a second process.",
	"url": null,
	"owner": "Microsoft Corporation",
	"publication_number": "08938738",
	"publication_date": "2015-01-20",
	"application_number": "12147671",
	"application_date": "2008-06-27",
	"tags": null,
	"slug": "shared-usermode-for-controlling-synchronized-access-to-a-shared-resource",
	"match_type": "description"
},
{
	"name": "Machine vision inspection system comprising two cameras having a rotational offset",
	"summary": "",
	"abstract": "A machine vision inspection system comprises an optical portion providing an image of a field of view of a workpiece which may be a magnified image. A first camera and a second camera provide first and second images of a shared or common field of view of the workpiece and are arranged such that the orientation of the common field of view imaged in the first camera is rotated relative to the orientation of the common field of view imaged in the second camera. Signal processing provides an edge measurement of an edge feature within the common field of view and determines which of the first and second images is used as a basis for the edge measurement based on whether their respective edge orientation (with respect to the pixel array of each camera) differs from the pixel array orientation of their associated camera by an orientation difference threshold amount.",
	"url": null,
	"owner": "Mitutoyo Corporation",
	"publication_number": "08937654",
	"publication_date": "2015-01-20",
	"application_number": "13592283",
	"application_date": "2012-08-22",
	"tags": null,
	"slug": "machine-vision-inspection-system-comprising-two-cameras-having-a-rotational-offset",
	"match_type": "description"
},
{
	"name": "Synchronization modules for programmable hardware and use",
	"summary": "",
	"abstract": "Customizing a target system. The target system may include a first device with a first programmable hardware element (PHE) and a second device with a second PHE. Synchronization modules may be provided for implementation on the first and second PHEs. The synchronization modules may provide a standard interface for interacting with other code. A user may specify user-created code for the first and second PHEs which utilizes the synchronization modules. The user-created code may interact with the synchronization modules using the standard interface. Accordingly, hardware descriptions may be generated for the first and second PHEs of the target system. Different modules may be used for different interconnects. Additionally, multiple synchronization modules may be used, e.g., dynamically, during operation of the target system.",
	"url": null,
	"owner": "National Instruments Corporation",
	"publication_number": "08938716",
	"publication_date": "2015-01-20",
	"application_number": "14323479",
	"application_date": "2014-07-03",
	"tags": null,
	"slug": "synchronization-modules-for-programmable-hardware-and-use",
	"match_type": "description"
},
{
	"name": "Techniques for optimization of barcodes",
	"summary": "",
	"abstract": "Techniques for optimization of barcode processing are presented. Barcode configuration data is distributed from a server service to a mobile client device. The mobile client device includes an application to inspect the capabilities of mobile client device and render the barcode configuration data into a barcode that is optimally scanned from the mobile client device when presented on a display of the mobile client device.",
	"url": null,
	"owner": "NCR Corporation",
	"publication_number": "08931687",
	"publication_date": "2015-01-13",
	"application_number": "13222147",
	"application_date": "2011-08-31",
	"tags": null,
	"slug": "techniques-for-optimization-of-barcodes",
	"match_type": "description"
},
{
	"name": "Configuring a speech engine for a multimodal application based on location",
	"summary": "",
	"abstract": "Methods, apparatus, and products are disclosed for configuring a speech engine for a multimodal application based on location. The multimodal application operates on a multimodal device supporting multiple modes of user interaction with the multimodal application. The multimodal application is operatively coupled to a speech engine. Configuring a speech engine for a multimodal application based on location includes: receiving a location change notification in a location change monitor from a device location manager, the location change notification specifying a current location of the multimodal device; identifying, by the location change monitor, location-based configuration parameters for the speech engine in dependence upon the current location of the multimodal device, the location-based configuration parameters specifying a configuration for the speech engine at the current location; and updating, by the location change monitor, a current configuration for the speech engine according to the identified location-based configuration parameters.",
	"url": null,
	"owner": "Nuance Communications, Inc.",
	"publication_number": "08938392",
	"publication_date": "2015-01-20",
	"application_number": "11679297",
	"application_date": "2007-02-27",
	"tags": null,
	"slug": "configuring-a-speech-engine-for-a-multimodal-application-based-on-location",
	"match_type": "description"
},
{
	"name": "System and method for detecting errors in audio data",
	"summary": "",
	"abstract": "An application programming interface (API) executed by a first processing unit combines audio data samples with error code values generated for those samples. The API then causes a data stream to be opened having sufficient bandwidth to accommodate combined samples made up of audio data samples and corresponding error code values. The combined samples are then transmitted to a decoder and validation unit within a second processing unit that receives the combined data, strips the error code values and validates the audio data based on the error code values. When the error code values indicate that the audio data has been compromised, the second processing unit terminates the output of sound derived from the audio data.",
	"url": null,
	"owner": "NVIDIA Corporation",
	"publication_number": "08938661",
	"publication_date": "2015-01-20",
	"application_number": "13564610",
	"application_date": "2012-08-01",
	"tags": null,
	"slug": "system-and-method-for-detecting-errors-in-audio-data",
	"match_type": "abstract"
},
{
	"name": "Method and system for data usage accounting in a computing device",
	"summary": "",
	"abstract": "A method and system for data usage accounting are described herein. As an example, the method can be practiced in a setting that includes both secure applications and unsecure applications. Via one of the secure applications, a request to access data can be received in which the request is intended for a content provider via a system service. The request that is intended for the content provider via the system service can be intercepted and modified, which can cause the system service to direct the request back to the secure application instead of the content provider. In addition, a connection can be established with the content provider for the request through the secure application to enable data usage accounting of data that is returned by the content provider.",
	"url": null,
	"owner": "OpenPeak Inc.",
	"publication_number": "08938547",
	"publication_date": "2015-01-20",
	"application_number": "14478066",
	"application_date": "2014-09-05",
	"tags": null,
	"slug": "method-and-system-for-data-usage-accounting-in-a-computing-device",
	"match_type": "description"
},
{
	"name": "Method and system for Infiniband host channel adapter multicast packet replication mechanism",
	"summary": "",
	"abstract": "A method for multicast replication by a host channel adapter (HCA) involving receiving a multicast packet, by a receive pipeline for processing packets of the HCA, storing, in a payload RAM within the HCA, a multicast packet payload corresponding to a data portion of the multicast packet, identifying, from a multicast header of the multicast packet, a plurality of destination underlying functions and a plurality of corresponding destination QPs to which the multicast packet is directed, wherein each destination underlying function of corresponds to a virtual machine located on a host, identifying, from the multicast header, information to be replicated for each multicast packet destination, injecting, by the HCA, a number of multicast packet descriptors corresponding to a number of the corresponding destination QPs into the receive pipeline of the HCA, and copying, from the payload RAM, the multicast packet payload to each of the corresponding destination QPs.",
	"url": null,
	"owner": "Oracle International Corporation",
	"publication_number": "08937949",
	"publication_date": "2015-01-20",
	"application_number": "13721704",
	"application_date": "2012-12-20",
	"tags": null,
	"slug": "method-and-system-for-infiniband-host-channel-adapter-multicast-packet-replication-mechanism",
	"match_type": "description"
},
{
	"name": "Networking in a virtual computing infrastructure",
	"summary": "",
	"abstract": "A cloud computing environment having a plurality of computing nodes is described. Upon receiving authorization, a plurality of virtual machines may be communicated to provide at least one virtual network to service to the plurality virtual machines. Each of the plurality of virtual machines communicates with a virtual network layer at a virtual interface via at least one virtual Ethernet (vEthernet), An IP gateway to a network is provided to the plurality of virtual machines. Communications between the fP gateway and the network are facilitated. Communications between a network control layer and at least one network are routed.",
	"url": null,
	"owner": "Oracle International Corporation",
	"publication_number": "08938540",
	"publication_date": "2015-01-20",
	"application_number": "13299335",
	"application_date": "2011-11-17",
	"tags": null,
	"slug": "networking-in-a-virtual-computing-infrastructure",
	"match_type": "description"
},
{
	"name": "Systems and methods for analyzing performance of an entity",
	"summary": "",
	"abstract": "Systems and methods are provided for analyzing entity performance. In accordance with one implementation, a method is provided that includes receiving data associated with a geographic region and transforming the received data into an object model. The method also includes analyzing the object model to associate the received data with a plurality of entities and to associate the received data with a plurality of sub-geographic regions of the geographic region. The method also includes applying a prediction model to the plurality of sub-geographic regions using the object model to determine a predicted performance for at least one entity of the plurality of entities. Further, the method includes determining actual performance for the at least one entity and providing a user interface that includes information associated with the predicted performance, the actual performance, or a combination of the predicted performance and the actual performance.",
	"url": null,
	"owner": "Palantir Technologies Inc.",
	"publication_number": "08938686",
	"publication_date": "2015-01-20",
	"application_number": "14045720",
	"application_date": "2013-10-03",
	"tags": null,
	"slug": "systems-and-methods-for-analyzing-performance-of-an-entity",
	"match_type": "description"
},
{
	"name": "Notifying a user of an available media object",
	"summary": "",
	"abstract": "Among other features, notification is presented on a mobile device to a user to advise the user of the availability of a media object that (a) has been received from a server and stored on the mobile device without the user having been aware of the receipt or storage, or (b) has newly become available for streaming from the server to the mobile device.",
	"url": null,
	"owner": "Penthera Partners, Inc.",
	"publication_number": "08937543",
	"publication_date": "2015-01-20",
	"application_number": "14277829",
	"application_date": "2014-05-15",
	"tags": null,
	"slug": "notifying-a-user-of-an-available-media-object",
	"match_type": "description"
},
{
	"name": "Modifying electronic data layout for efficient printing of electronic data",
	"summary": "",
	"abstract": "A system and a method are disclosed for modifying a layout associated with data to reduce the amount of paper used when generating a paper copy of the data. Responsive to receiving an input to modify a layout associated with data presented on a computing device for printing, the layout is modified. In one embodiment, a type associated with the data is determined, and a modified layout is generated based on the type. For example, the layout is differently modified if the data is an electronic document, a spreadsheet, a Web page or another type of data. In one embodiment, the modified layout is displayed on a display and the data and the modified layout are transmitted to a printer responsive to an input confirming the modified layout.",
	"url": null,
	"owner": "PrintEco, Inc.",
	"publication_number": "08937744",
	"publication_date": "2015-01-20",
	"application_number": "13562146",
	"application_date": "2012-07-30",
	"tags": null,
	"slug": "modifying-electronic-data-layout-for-efficient-printing-of-electronic-data",
	"match_type": "description"
},
{
	"name": "Inter-processor communication techniques in a multiple-processor computing platform",
	"summary": "",
	"abstract": "This disclosure describes communication techniques that may be used within a multiple-processor computing platform. The techniques may, in some examples, provide software interfaces that may be used to support message passing within a multiple-processor computing platform that initiates tasks using command queues. The techniques may, in additional examples, provide software interfaces that may be used for shared memory inter-processor communication within a multiple-processor computing platform. In further examples, the techniques may provide a graphics processing unit (GPU) that includes hardware for supporting message passing and/or shared memory communication between the GPU and a host CPU.",
	"url": null,
	"owner": "QUALCOMM Incorporated",
	"publication_number": "08937622",
	"publication_date": "2015-01-20",
	"application_number": "13235266",
	"application_date": "2011-09-16",
	"tags": null,
	"slug": "interprocessor-communication-techniques-in-a-multipleprocessor-computing-platform",
	"match_type": "description"
},
{
	"name": "Uninterruptable group communication sessions within a wireless communications system",
	"summary": "",
	"abstract": "A call request message is sent from an access terminal to an application server in order to request initiation of a group communication session to a communication group and to request that an allocation of the floor to the given access terminal for the duration of the given group communication session remain uninterrupted by call targets of the session. The application server announces the session, and sends a floor-grant to the access terminal after the session is accepted by at least one target. The access terminal forwards media to the application server which is then forwarded to the at least one target. The floor is not transferred away from the access terminal during the session. For example, floor requests are suppressed at the at least one target, or floor requests are sent by the at least one target but are then ignored or denied by the application server.",
	"url": null,
	"owner": "QUALCOMM Incorporated",
	"publication_number": "08938498",
	"publication_date": "2015-01-20",
	"application_number": "12751565",
	"application_date": "2010-03-31",
	"tags": null,
	"slug": "uninterruptable-group-communication-sessions-within-a-wireless-communications-system",
	"match_type": "description"
},
{
	"name": "Providing customized visualization of application binary interface/application programming interface-related information",
	"summary": "",
	"abstract": "A mechanism for providing customized visualization of Application Binary Interface-related information is described. A method of embodiments of the invention includes querying a database storing interface provisioning details and interface usage details relating to application binary interfaces (ABIs) associated with shared libraries provided by an operating system running on a computer system. The database further stores comparison results obtained from comparing the interface provisioning details with the interface usage details. The method further includes extracting a set of information from the database, and customizing visualization representation of the set of information. The set of information is composed of any part or all of the interface provisioning details, the interface usage details, and the comparison results.",
	"url": null,
	"owner": "Red Hat, Inc.",
	"publication_number": "08938706",
	"publication_date": "2015-01-20",
	"application_number": "12953023",
	"application_date": "2010-11-23",
	"tags": null,
	"slug": "providing-customized-visualization-of-application-binary-interfaceapplication-programming-interfacerelated-information",
	"match_type": "name"
},
{
	"name": "Communication streams",
	"summary": "",
	"abstract": "Embodiments described herein organize and percolate important messaging and information to the top of a communications pile, and create a high ratio of front-and-center communication versus chatter communication. This is analogous to creating a high signal-to-noise ratio in signal communications. Thus, embodiments described herein raise the desired signal level high above the noise level to obtain a visual at-a-glance level of communication with reduced clutter or no clutter.",
	"url": null,
	"owner": "Rofori Corporation",
	"publication_number": "08938514",
	"publication_date": "2015-01-20",
	"application_number": "14329665",
	"application_date": "2014-07-11",
	"tags": null,
	"slug": "communication-streams",
	"match_type": "description"
},
{
	"name": "Method and apparatus for providing service",
	"summary": "",
	"abstract": "A method and apparatus for providing a service in a service providing device are provided. The method includes receiving, from a terminal, information about a wireless transmitter/receiver whose vicinity the terminal is located within; determining a differentiated service to be provided to the terminal according to the received information about the wireless transmitter/receiver; and providing the determined differentiated service to the terminal.",
	"url": null,
	"owner": "Samsung Electronics Co., Ltd",
	"publication_number": "08937932",
	"publication_date": "2015-01-20",
	"application_number": "13631161",
	"application_date": "2012-09-28",
	"tags": null,
	"slug": "method-and-apparatus-for-providing-service",
	"match_type": "description"
},
{
	"name": "Method and system for utilizing packaged content sources to identify and provide information based on contextual information",
	"summary": "",
	"abstract": "A method and system for providing access to content on an electronic device is provided. One embodiment includes receiving contextual information and querying a packaged content source for content related to the contextual information. Available content relating to the contextual information from the packaged content source is then indicated for user access.",
	"url": null,
	"owner": "Samsung Electronics Co., Ltd.",
	"publication_number": "08938465",
	"publication_date": "2015-01-20",
	"application_number": "12544994",
	"application_date": "2009-08-20",
	"tags": null,
	"slug": "method-and-system-for-utilizing-packaged-content-sources-to-identify-and-provide-information-based-on-contextual-information",
	"match_type": "description"
},
{
	"name": "Forming networks of users associated with a central entity",
	"summary": "",
	"abstract": "Computer-implemented methods, computer-readable media, and systems for forming networks of users associated with a central entity. When a central entity receives multiple requests from multiple users to register for an event associated with the entity, the entity forms a user network that did not exist until then. The entity receives data describing the users using which the entity generates user interfaces showing all users in the network, and presents the user interfaces on users' computer systems. When a subset of the users check-in with the entity, the entity displays information about one of the users in the subset to another, and allows the users to communicate with each other. When the event associated with the entity ends, the entity terminates the network. In this manner, the central entity forms temporary user networks that expire when an event scheduled at the central entity occurs.",
	"url": null,
	"owner": "SAP Portals Israel Ltd",
	"publication_number": "08938504",
	"publication_date": "2015-01-20",
	"application_number": "13451220",
	"application_date": "2012-04-19",
	"tags": null,
	"slug": "forming-networks-of-users-associated-with-a-central-entity",
	"match_type": "description"
},
{
	"name": "Invalidation of metadata buffers",
	"summary": "",
	"abstract": "A quick buffer validity check can optionally be performed when a potential invalidity of the content of a buffer is identified. The identifying of the potential invalidity condition can include determining that a most recent lifecycle management event timestamp is more recent than a most recent buffer validity check timestamp for the buffer. To determine whether the buffer contents need to be refreshed, a list of the last changed timestamps for the constituent elements of the buffer can be compared to a new list. If the new list and the old list are not identical, the buffer can be rebuilt.",
	"url": null,
	"owner": "SAP SE",
	"publication_number": "08938645",
	"publication_date": "2015-01-20",
	"application_number": "13623059",
	"application_date": "2012-09-19",
	"tags": null,
	"slug": "invalidation-of-metadata-buffers",
	"match_type": "description"
},
{
	"name": "User-driven configuration",
	"summary": "",
	"abstract": "The present disclosure involves systems, software, and computer implemented methods for providing user-driven configuration of application content packages. One process includes operations for receiving a request for configuring a user productivity feature for integration with an application running on a client device, presenting a configuration tool for allowing user-driven configuration of an application content package associated with the user productivity feature, and deploying the application content package for installation on the client device after receiving configuration of the application content package through the configuration tool. In some instances, the configuration tool is a hosted service provided on a server in a cloud computing network. Further, presenting the configuration tool can include presenting one or more back-end systems associated with the application for selection as a destination for the user productivity feature.",
	"url": null,
	"owner": "SAP SE",
	"publication_number": "08938734",
	"publication_date": "2015-01-20",
	"application_number": "13326174",
	"application_date": "2011-12-14",
	"tags": null,
	"slug": "userdriven-configuration",
	"match_type": "description"
},
{
	"name": "Information processing device, information processing method, and program",
	"summary": "",
	"abstract": "The present invention relates to an information processing device, an information processing method, and a program, whereby playback of PG and TextST images can be controlled from a BD-J application. There are defined a mono PG/TextST stream of a PG/TextST image that is a mono image serving as a 2D image, a stereo PG/TextST stream of a PG/TextST image that is a stereo image serving as a 3D image, and a PG/TextST stream for offset of a PG/TextST image that is a mono image to be used for generating a stereo image along with an offset value for giving disparity to the mono image, as a PG/TextST stream of a PG/TextST image. An stream selecting API selects a mono PG/TextST stream, a stereo PG/TextST stream, or a PG/TextST stream for offset. The present invention may be applied to a BD player configured to play a BD, or the like.",
	"url": null,
	"owner": "Sony Corporation",
	"publication_number": "08938156",
	"publication_date": "2015-01-20",
	"application_number": "13974635",
	"application_date": "2013-08-23",
	"tags": null,
	"slug": "information-processing-device-information-processing-method-and-program",
	"match_type": "description"
},
{
	"name": "Automatic provisioning of new users of interest for capture on a communication network",
	"summary": "",
	"abstract": "A system, method, and apparatus for collecting data streams, such as data packets, on a network, such as the Internet, are disclosed. A metadata portion of at least one of the data streams is analyzed on the network and evaluated using a metadata processing engine to identify a relationship between at least two of the plurality of data streams, e.g., a relationship between multiple users of a network, regardless of whether the users are currently of interest or if they are not of interest. An interface manager can receive an information of a new user of interest, evaluate the new user of interest for redundancy against existing known users of interest of the NMS; then communicate the information of the new user of interest to at least one access device to collect data streams associated with the new user of interest.",
	"url": null,
	"owner": "SS8 Networks, Inc.",
	"publication_number": "08938534",
	"publication_date": "2015-01-20",
	"application_number": "13334785",
	"application_date": "2011-12-22",
	"tags": null,
	"slug": "automatic-provisioning-of-new-users-of-interest-for-capture-on-a-communication-network",
	"match_type": "description"
},
{
	"name": "Cloning using streaming restore",
	"summary": "",
	"abstract": "Various systems and methods for creating a clone using streaming restore. For example, one method can involve receiving a set of storage blocks that include data associated with a state of a source computing entity. The method then involves creating a clone of the source computer system at an endpoint computer system. The endpoint computer system creates the clone by restoring the storage blocks, which involves storing the storage blocks to a memory at the endpoint computer system. The created clone has a state that corresponds to the state of the source computer system.",
	"url": null,
	"owner": "Symantec Corporation",
	"publication_number": "08938643",
	"publication_date": "2015-01-20",
	"application_number": "13092207",
	"application_date": "2011-04-22",
	"tags": null,
	"slug": "cloning-using-streaming-restore",
	"match_type": "description"
},
{
	"name": "Systems and methods for using virtualization to implement information rights management",
	"summary": "",
	"abstract": "A method for using virtualization to implement information rights management. The method may include: 1) intercepting, at a virtualization module, a request from an application to access data; 2) querying an information-rights-management database for a virtualization policy associated with the access request; 3) receiving, at the virtualization module, the virtualization policy from the information-rights-management database; and 4) controlling access to the data by applying the virtualization policy to the access request in a manner that is transparent to the application. Various other methods, systems, and computer-readable media are also disclosed.",
	"url": null,
	"owner": "Symantec Corporation",
	"publication_number": "08938808",
	"publication_date": "2015-01-20",
	"application_number": "12715213",
	"application_date": "2010-03-01",
	"tags": null,
	"slug": "systems-and-methods-for-using-virtualization-to-implement-information-rights-management",
	"match_type": "description"
},
{
	"name": "Query execution plan revision for error recovery",
	"summary": "",
	"abstract": "A computer-implemented method, apparatus and article of manufacture for performing an automatic error recovery in a database system. Automatic error recovery is performed for a query execution plan, following errors, problems or failures that occur during execution, by automatically or manually deactivating and/or activating components, features or code paths, and then re-submitting the query execution plan for execution in the computer system.",
	"url": null,
	"owner": "Teradata US, Inc.",
	"publication_number": "08938644",
	"publication_date": "2015-01-20",
	"application_number": "12960307",
	"application_date": "2010-12-03",
	"tags": null,
	"slug": "query-execution-plan-revision-for-error-recovery",
	"match_type": "description"
},
{
	"name": "Techniques for fast loading of data from an external distributed file system to a database management system",
	"summary": "",
	"abstract": "Techniques for fast loading data from an external distributed file system (DFS) to a database management system (DBMS) are provided. Assigning a portion of data from a file located in the DFS to each of a plurality of DFS clients. Configuring each DFS client to interact with a specific gateway from a plurality of gateways associated with the DBMS. Each gateway configured to send its portion of the file received from its designated client to every access module processor (AMP) controlled by that gateway. Each AMP processes a portion of the data received from the gateway to load the data into a table of the DBMS.",
	"url": null,
	"owner": "Teradata US, Inc.",
	"publication_number": "08938480",
	"publication_date": "2015-01-20",
	"application_number": "13340364",
	"application_date": "2011-12-29",
	"tags": null,
	"slug": "techniques-for-fast-loading-of-data-from-an-external-distributed-file-system-to-a-database-management-system",
	"match_type": "description"
},
{
	"name": "Advancements in data distribution methods and referential integrity",
	"summary": "",
	"abstract": "An elastic parallel database system where data distribution is container- and container-context based. Container Based Tables are defined and Container Member Tables achieve co-location of data as needed. A polymorphic key may also establish polymorphic key relationships between rows in one table and rows in many other possible tables.",
	"url": null,
	"owner": "Tesora, Inc.",
	"publication_number": "08938472",
	"publication_date": "2015-01-20",
	"application_number": "13966980",
	"application_date": "2013-08-14",
	"tags": null,
	"slug": "advancements-in-data-distribution-methods-and-referential-integrity",
	"match_type": "description"
},
{
	"name": "Preventing interference between subsystem blocks at a design time",
	"summary": "",
	"abstract": "A method of preventing interference between subsystem blocks includes obtaining an integrity level for a first subsystem block, obtaining an integrity level for a second subsystem block, assigning an integrity level property to at least one input port of the first block, the integrity level property assigned to the input port of the first block being based on the integrity level defined for the first block, and assigning an integrity level property to at least one output port of the second block, the integrity level property assigned to the output port of the second block being based on the integrity level defined for the second block. The method further includes evaluating the integrity level property of at least one input/output pair to determine whether an inappropriate connection exists, and performing a first action when an inappropriate connection exists, or performing a second action when an appropriate connection exists.",
	"url": null,
	"owner": "The MathWorks, Inc.",
	"publication_number": "08938710",
	"publication_date": "2015-01-20",
	"application_number": "13729982",
	"application_date": "2012-12-28",
	"tags": null,
	"slug": "preventing-interference-between-subsystem-blocks-at-a-design-time",
	"match_type": "description"
},
{
	"name": "Methods, systems, and computer program products for network server performance anomaly detection",
	"summary": "",
	"abstract": "Methods, systems, and computer readable media for network server performance anomaly detection are disclosed. According to one aspect of the subject matter disclosed, a method is disclosed for real-time computation of an endpoint performance measure based on transport and network layer header information. The method includes passively collecting transport and network layer header information from packet traffic in a network. Connections in the network are modeled using an abstract syntax for characterizing a sequence of application-level bidirectional interactions between endpoints of each connection and delays between the interactions. Application-level characteristics of the packet traffic are determined based on the modeled connections. A performance measure of at least one endpoint is computed based on the application-level characteristics and the modeled connections.",
	"url": null,
	"owner": "The University of North Carolina at Chapel Hill",
	"publication_number": "08938532",
	"publication_date": "2015-01-20",
	"application_number": "13145850",
	"application_date": "2010-04-08",
	"tags": null,
	"slug": "methods-systems-and-computer-program-products-for-network-server-performance-anomaly-detection",
	"match_type": "description"
},
{
	"name": "System and method for personalized TV",
	"summary": "",
	"abstract": "A Personal TV System receives a plurality of video segments constituting a TV program and information describing each segment, and controls the display of the segments to a viewer in accordance with preferences of the viewer and with the description of each segment. Segments may be omitted or replaced with substitute segments. The viewer may review his preferences and edit or replace them. In a multi-viewer household, the system may prompt a viewer to confirm her preferences. A TV program may contain interactive segments, and when the viewer chooses to interact with a particular segment, the system automatically stores all subsequently received segments for later viewing while the viewer interacts with the selected segment. The system may present TV program choices to the viewer selected and arranged in accordance with her preferences.",
	"url": null,
	"owner": "Thomson Licensing",
	"publication_number": "08938758",
	"publication_date": "2015-01-20",
	"application_number": "11370081",
	"application_date": "2006-03-06",
	"tags": null,
	"slug": "system-and-method-for-personalized-tv",
	"match_type": "description"
},
{
	"name": "Bootstrapper and software download manager",
	"summary": "",
	"abstract": "The present invention provides a bootstrapper and download manager for handling the download and installation of one or more software products to a computer. The invention determines system requirements and whether any prerequisite software is required by a software product to be downloaded. Any necessary prerequisite software is installed on the computer and if more than one software product has a shared prerequisite, then the invention recognizes that and prevents downloading multiple ones of the shared prerequisites. Also, in the event of an interruption or error during download, the invention can resume downloading or installation based on the download successfully stored on the local machine without requiring the download all over again. This saves considerable time during the download and install process and enhances user productivity and experience. A download manager provides a user interface to efficiently select from multiple software products for download and negotiate issues such as multiple and different product licenses.",
	"url": null,
	"owner": "Thomson Reuters Global Resources",
	"publication_number": "08938735",
	"publication_date": "2015-01-20",
	"application_number": "11897599",
	"application_date": "2007-08-31",
	"tags": null,
	"slug": "bootstrapper-and-software-download-manager",
	"match_type": "description"
},
{
	"name": "Malware removal without virus pattern",
	"summary": "",
	"abstract": "Antivirus software detects malware on a computer and the landing time of the malware is determined; a time window around the landing time is determined. Optionally requiring the landing time of the malware to be before the installation time of the antivirus software eliminates false positives. Any files of the computer systems that have a creation time within the time window are suspect. If the prevalence value and the maturity value of the suspect file are below respective thresholds then it is concluded that the file is malware and it is deleted. No virus signature or virus pattern that matches the deleted file need be relied upon or used. The detected malware may be the original mother file or a dropped file. An online prevalence and maturity database is used. The launching time of the malware may be used instead of the landing time.",
	"url": null,
	"owner": "Trend Micro Inc.",
	"publication_number": "08938807",
	"publication_date": "2015-01-20",
	"application_number": "13663406",
	"application_date": "2012-10-29",
	"tags": null,
	"slug": "malware-removal-without-virus-pattern",
	"match_type": "description"
},
{
	"name": "System and method for triggering on platform usage",
	"summary": "",
	"abstract": "A system and method for triggering on platform usage can include at a platform, receiving and storing a trigger configuration of an account; operating a platform comprising internally executing a process on behalf of an account and publishing at least one event when executing the process; at the platform, incrementing a counter in response to the at least one event and if the stored trigger configuration species a usage key associated with a category of counted events of the at least one event; monitoring counters in a context of an associated trigger; and processing the trigger upon the counter satisfying condition of an associated trigger.",
	"url": null,
	"owner": "Twilio, Inc.",
	"publication_number": "08938053",
	"publication_date": "2015-01-20",
	"application_number": "14054464",
	"application_date": "2013-10-15",
	"tags": null,
	"slug": "system-and-method-for-triggering-on-platform-usage",
	"match_type": "description"
},
{
	"name": "Methods and apparatus for E-mail-based management of virtualized environments",
	"summary": "",
	"abstract": "A technique for remotely managing virtual machines employs a user interface (UI) of a rich e-mail client that is configured to interpret metadata included in a communication received from a management server for the virtual machines and, in response, generate one or more UI elements. The UI includes a first region that displays a message from the management server and a second region that displays the one or more UI elements for causing a command to be generated and sent to the management server in response to a predetermined input made thereon.",
	"url": null,
	"owner": "VMware, Inc.",
	"publication_number": "08938680",
	"publication_date": "2015-01-20",
	"application_number": "13402475",
	"application_date": "2012-02-22",
	"tags": null,
	"slug": "methods-and-apparatus-for-emailbased-management-of-virtualized-environments",
	"match_type": "description"
},
{
	"name": "Configuring and controlling wagering game compatibility",
	"summary": "",
	"abstract": "A wagering game system and its operations are described herein. In some embodiments, the operations can include determining that a secondary wagering game application is compatible with a primary wagering game application, wherein compatibility is based in-part on an ability of the primary wagering game application to provide wagering game information to the secondary wagering game application via an application programming interface. The operations can also include enabling the secondary wagering game to present a secondary wagering game in connection with a primary wagering game controlled by the primary wagering game application.",
	"url": null,
	"owner": "WMS Gaming, Inc.",
	"publication_number": "08926418",
	"publication_date": "2015-01-06",
	"application_number": "13744892",
	"application_date": "2013-01-18",
	"tags": null,
	"slug": "configuring-and-controlling-wagering-game-compatibility",
	"match_type": "abstract"
},
{
	"name": "Comparing and provisioning configurations for a client having a windows-based embedded image",
	"summary": "",
	"abstract": "Examples of methods and apparatus are provided for comparing and provisioning configurations for a local client having a windows-based embedded image. The apparatus may include a retrieval module of the local client configured to facilitate locating a remote repository server containing a new configuration file, to facilitate obtaining the new configuration file from the remote repository server, and to facilitate obtaining a previous configuration file associated with a previous configuration change successfully applied to the embedded image. The apparatus may include a configuration comparison module of the local client configured to compare the new configuration file with the previous configuration file. The apparatus may include an apply settings module of the local client configured to apply, to the embedded image, one of a new configuration change and the previous configuration change based on the comparison. The new configuration change may be based on the new configuration file.",
	"url": null,
	"owner": "Wyse Technology L.L.C.",
	"publication_number": "08938524",
	"publication_date": "2015-01-20",
	"application_number": "13035754",
	"application_date": "2011-02-25",
	"tags": null,
	"slug": "comparing-and-provisioning-configurations-for-a-client-having-a-windowsbased-embedded-image",
	"match_type": "description"
},
{
	"name": "Method for monitoring the unauthorized use of a device",
	"summary": "",
	"abstract": "The invention is directed to systems and methods for detecting the loss, theft or unauthorized use of a device and/or altering the functionality of the device in response. In one embodiment, a device monitors its use, its local environment, and/or its operating context to determine that the device is no longer within the control of an authorized user. The device may receive communications or generate an internal signal altering its functionality, such as instructing the device to enter a restricted use mode, a surveillance mode, to provide instructions to return the device and/or to prevent unauthorized use or unauthorized access to data. Additional embodiments also address methods and systems for gathering forensic data regarding an unauthorized user to assist in locating the unauthorized user and/or the device.",
	"url": null,
	"owner": "Yougetitback Limited",
	"publication_number": "08932368",
	"publication_date": "2015-01-13",
	"application_number": "12203832",
	"application_date": "2008-09-03",
	"tags": null,
	"slug": "method-for-monitoring-the-unauthorized-use-of-a-device",
	"match_type": "description"
}]